In [1]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({
    'Person': ['Alice', 'Bob', 'Charlie'],
    'Sales': [100, 150, 200]
})
df1

    Person  Sales
0    Alice    100
1      Bob    150
2  Charlie    200

In [4]:
df2 = pd.DataFrame({
    'Person': ['Alice', 'Bob', 'Charlie'],
    'Sales': [50, 75, 125]
})
df2

    Person  Sales
0    Alice     50
1      Bob     75
2  Charlie    125

In [5]:
combined_df = pd.concat([df1, df2])
combined_df

    Person  Sales
0    Alice    100
1      Bob    150
2  Charlie    200
0    Alice     50
1      Bob     75
2  Charlie    125

In [6]:
final_df = combined_df.groupby('Person', as_index=False).sum()
final_df

    Person  Sales
0    Alice    150
1      Bob    225
2  Charlie    325